SO/Scenario 1.8/SO_16_Delete_SO_Details_By_SO_Id.yaml
vconfig:
  target: "https://moonlay-api.dbo.dev"
  phases:
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
scenarios:
  - flow:
      - delete: 
          url: "/order-srv//sales-orders/{{ so_id }}/details" 
          headers:
            Authorization: "Basic ZGJvLW9yZGVyLXNydjpkYm8tb3JkZXItc3J2LXBhc3N3ZA=="